 
!
"
#
$
%
&
'
(
)
*
+
,
-
.
/
0
1
2
3
4
5
6
7
8
9
:
;
=
>
?
A
B
C
D
E
F
G
H
I
J
K
L
M
N
O
P
Q
R
S
T
U
V
W
X
Y
Z
[
\
]
_
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
{
~
¡
¢
£
¤
¥
§
¨
©
ª
«
¬
®
¯
°
±
²
³
´
µ
·
¹
º
»
¼
½
¾
¿
À
Á
Â
Ã
Ä
Å
Æ
Ç
È
É
Ê
Í
Î
Ñ
Ó
Ô
Ö
×
Ø
Ú
Ü
Ý
Þ
ß
à
á
â
ã
ä
å
æ
ç
è
é
ê
ë
ì
í
î
ï
ð
ñ
ò
ó
ô
õ
ö
÷
ø
ù
ú
û
ü
ý
þ
Ā
ā
ă
ą
Ć
ć
Č
č
Đ
đ
ē
ė
ę
ě
ĝ
Ğ
ğ
ħ
ĩ
Ī
ī
į
İ
ı
ļ
Ł
ł
ń
ņ
ň
ŋ
Ō
ō
ŏ
ő
œ
Ř
ř
Ś
ś
Ş
ş
Š
š
Ť
ť
ũ
Ū
ū
ŭ
ů
ų
ŵ
Ź
ź
Ż
ż
Ž
ž
ƒ
ơ
ư
ǎ
ǐ
ǒ
ǔ
ș
ț
ɑ
ɔ
ɕ
ə
ɛ
ɜ
ɡ
ɣ
ɥ
ɨ
ɪ
ɱ
ɲ
ɴ
ɷ
ɹ
ɾ
ʁ
ʂ
ʃ
ʉ
ʊ
ʌ
ʏ
ʒ
ʔ
ʰ
ʷ
ʹ
ʻ
ʾ
ʿ
ˆ
ˈ
ˌ
ː
˙
˜
ˢ
ˣ
˹
˺
́
̃
̄
̅
Έ
Α
Β
Γ
Δ
Ε
Ζ
Θ
Ι
Κ
Λ
Μ
Ν
Ξ
Ο
Π
Ρ
Σ
Τ
Φ
Χ
Ψ
Ω
ά
έ
ή
ί
α
β
γ
δ
ε
ζ
η
θ
ι
κ
λ
μ
ν
ξ
ο
π
ρ
ς
σ
τ
υ
φ
χ
ψ
ω
ϊ
ό
ύ
ώ
ϑ
ϕ
ϵ
Ё
І
А
Б
В
Г
Д
Е
Ж
З
И
Й
К
Л
М
Н
О
П
Р
С
Т
У
Ф
Х
Ц
Ч
Ш
Щ
Ь
Э
Ю
Я
а
б
в
г
д
е
ж
з
и
й
к
л
м
н
о
п
р
с
т
у
ф
х
ц
ч
ш
щ
ъ
ы
ь
э
ю
я
ё
ђ
і
ғ
ք
ְ
ֲ
ִ
ֵ
ֶ
ַ
ָ
ֹ
ּ
־
ׁ
א
ב
ג
ד
ה
ו
ז
ח
ט
י
ך
כ
ל
ם
מ
ן
נ
ס
ע
ף
פ
ץ
צ
ק
ר
ש
ת
ء
آ
أ
إ
ئ
ب
ة
ت
ث
ج
ح
خ
د
ذ
ر
ز
س
ش
ص
ط
ع
غ
ف
ق
ك
ل
م
ن
ه
و
ى
ي
ٌ
ٍ
َ
ُ
ِ
ّ
ْ
پ
ڈ
ڤ
ک
ڵ
ڷ
ھ
ی
ے
ं
अ
आ
इ
उ
ऊ
ए
ओ
क
ख
ग
च
ज
ञ
ट
ड
ण
त
थ
द
ध
न
प
फ
ब
भ
म
य
र
ल
व
श
ष
स
ह
ा
ि
ी
ु
ू
े
ै
ो
्
ॐ
ก
ข
ค
ง
จ
ช
ญ
ณ
ด
ต
ท
ธ
น
บ
ป
พ
ฟ
ภ
ม
ย
ร
ล
ว
ศ
ส
ห
อ
ฮ
ะ
ั
า
ำ
ิ
ี
ึ
ื
ุ
ู
ฺ
เ
แ
โ
ไ
่
้
์
ḍ
Ḥ
ḥ
ṁ
ṃ
ṅ
ṇ
ṉ
Ṛ
ṛ
Ṡ
Ṣ
ṣ
Ṭ
ṭ
ạ
ả
Ấ
ấ
ầ
ẫ
ậ
ắ
ằ
ẳ
ặ
ẹ
ẻ
ẽ
ế
ề
ể
ễ
ệ
ị
ọ
ỏ
ố
ồ
ỗ
ộ
ớ
ờ
ở
ợ
ụ
ủ
ứ
ừ
ử
ữ
ự
ỳ
ỷ
ἀ
ἁ
Ἀ
ἐ
ἔ
ἡ
ἰ
ἱ
ἶ
Ἰ
ὀ
ὁ
ὄ
ὐ
ὑ
ὰ
ὲ
ὴ
ὶ
ὸ
ὼ
ᾶ
᾽
ῆ
ῇ
ῖ
ῦ
ῶ
ῷ
​
‎
‑
‒
–
—
―
‖
†
‡
•
…
‬
′
″
⁄
⁈
⁡
⁰
⁴
⁵
⁶
⁷
⁸
⁹
⁺
₂
₃
₄
₩
€
₱
₹
₽
℃
ℏ
ℓ
№
ℝ
™
⅓
⅔
⅛
⅜
⅝
→
⇒
∀
∂
∆
∈
∑
−
∗
√
∞
∫
≈
≊
≠
≡
≤
≥
⊆
⊗
⋅
⋯
█
⟨
⟩
、
。
〈
〉
《
》
〜
あ
う
え
お
か
が
き
ぎ
く
ぐ
け
げ
こ
ご
さ
ざ
し
じ
す
ず
せ
ぜ
そ
ぞ
た
だ
ち
っ
つ
で
と
ど
な
に
ね
の
は
ば
ぱ
ひ
び
ぴ
ぶ
ぷ
へ
べ
ほ
ま
み
む
め
も
ゃ
や
ゅ
ゆ
ょ
よ
ら
り
る
れ
ろ
わ
を
ん
ァ
ア
ィ
イ
ゥ
ウ
ェ
エ
ォ
オ
カ
ガ
キ
ギ
ク
グ
ケ
ゲ
コ
ゴ
サ
ザ
シ
ジ
ス
ズ
セ
ゼ
ソ
ゾ
タ
ダ
チ
ッ
ツ
テ
デ
ト
ド
ナ
ニ
ヌ
ネ
ノ
ハ
バ
パ
ヒ
ビ
ピ
フ
ブ
プ
ヘ
ベ
ペ
ホ
ボ
ポ
マ
ミ
ム
メ
モ
ャ
ヤ
ュ
ユ
ョ
ヨ
ラ
リ
ル
レ
ロ
ワ
ン
ヴ
・
ー
ㄅ
ㄉ
ㄍ
ㄎ
ㄏ
ㄒ
ㄓ
ㄚ
ㄛ
ㄜ
ㄣ
ㄱ
ㄲ
ㄴ
ㄵ
ㄷ
ㄸ
ㄹ
ㅁ
ㅂ
ㅇ
ㅌ
ㅍ
ㅏ
ㅣ
㉤
㋅
㎡
一
丁
七
万
丈
三
上
下
不
与
专
世
业
丛
东
丝
丢
两
严
丧
个
中
丰
串
临
丸
丹
为
主
丽
举
乃
久
么
义
之
乌
乎
乏
乐
乒
乓
乖
乗
乙
乜
九
乞
也
习
乡
书
买
乱
乳
乾
了
争
事
二
于
亏
云
互
五
井
亚
亜
亞
亡
交
亥
亦
产
亨
享
京
亭
亮
亲
人
什
仁
仆
今
介
从
仔
他
付
仙
代
令
以
仪
们
仰
仲
件
价
任
份
企
伊
伏
休
众
优
伙
会
伟
传
伤
伦
伪
伯
估
伴
似
伽
但
位
住
佑
体
何
余
佛
作
你
佩
佳
使
來
例
供
依
侯
侶
便
促
俊
俗
保
信
修
個
們
倔
候
倫
债
倾
假
偏
做
健
偶
傳
傷
働
像
僚
僧
儒
優
儿
允
元
兄
充
先
光
克
免
兎
兒
兔
党
入
內
全
兩
八
公
六
兮
兰
共
关
兴
兵
其
具
典
兹
养
兼
兽
内
円
再
冒
军
农
冠
冬
冰
冲
决
冷
冻
准
凌
凍
减
几
凡
凤
処
凯
凱
凶
出
击
刀
分
切
刑
划
列
则
刚
创
初
判
別
利
别
到
制
刷
券
刺
刻
則
削
前
剑
剧
剩
副
創
剿
劃
劇
力
办
功
加
务
动
助
努
劳
労
勉
勒
動
勘
務
募
勢
勤
勾
包
匈
化
北
匡
匪
匹
区
医
區
十
千
升
午
半
华
协
卑
卒
協
单
南
博
卡
卢
卦
卫
印
危
即
卷
卸
卻
卿
厂
厅
厕
厘
厚
原
厨
去
县
参
又
叉
及
友
双
反
发
叔
取
受
变
叙
叛
口
古
句
叩
只
叫
叭
可
台
史
右
号
司
吃
各
合
吉
同
名
后
吐
向
吗
君
吞
否
吧
听
启
吾
呀
呂
呃
呆
告
呕
员
呜
呢
呦
周
呪
呱
味
呻
呼
命
和
咎
咒
咖
咦
咪
咬
咳
咸
咻
哀
品
哂
哄
哇
哈
哉
响
哑
員
哥
哦
哪
哭
哼
唐
唤
售
唯
唱
唷
商
啊
問
啡
啦
喀
喂
善
喉
喔
喜
喝
喧
喱
営
喷
喻
喽
嗎
嗚
嗨
嗯
嘅
嘈
嘎
嘔
嘛
嘟
嘢
嘰
嘲
嘴
噁
噎
噗
器
嚴
嚷
囊
四
回
因
团
园
困
図
围
固
国
图
圆
圈
國
圍
園
圓
圖
團
土
圣
在
地
圳
场
坎
坐
坑
坟
坡
坤
坦
坷
型
埃
埋
城
域
培
基
堂
堅
堕
堡
堪
報
場
塊
塔
塞
境
墓
增
壞
士
壮
声
壳
壺
处
备
変
复
夏
外
多
夜
够
大
天
太
夫
央
失
头
夸
奇
奈
奉
奎
奔
套
奥
奧
女
奴
奶
她
好
如
妃
妇
妒
妙
妮
妹
妻
姆
始
姐
姓
委
姚
姜
姨
姫
姬
姻
威
娇
娘
婆
婚
婦
媒
媚
媳
媽
嫂
嫉
嫌
嬢
嬰
子
孔
字
存
孙
孝
孟
季
孤
学
孩
孫
學
宁
它
宅
宇
守
安
宋
完
宏
宗
官
宙
定
宜
宝
实
実
客
宣
室
宪
宫
宰
害
宴
宵
家
容
宽
宾
宿
寂
密
寇
富
寒
寝
寞
察
寥
實
寧
寨
寫
寬
寵
寶
寸
对
寺
导
対
寿
封
将
將
專
尊
對
導
小
少
尔
尖
尘
尚
尤
尬
就
尴
尹
尺
尼
尽
尾
尿
局
层
居
屈
届
屋
屏
展
属
屠
層
履
屬
屯
山
岁
岂
岐
岛
岩
岳
岸
峰
島
崎
川
州
巡
巢
工
左
巧
巨
差
己
已
巴
币
市
布
帅
师
希
帕
帝
带
師
席
帮
帯
帰
帶
常
幌
干
平
年
并
幸
幹
幻
幼
幽
幾
广
庄
庆
序
库
应
底
店
庙
庚
府
废
度
座
庫
庭
康
廉
廊
廓
廠
廣
廳
延
廷
建
开
弃
弄
式
弓
引
弟
张
弥
弦
張
強
弹
强
弾
彌
归
当
录
形
彦
彩
彰
影
役
彻
彼
征
待
很
律
後
徐
徒
従
得
御
復
微
徳
徵
德
徹
心
必
忆
忌
忍
志
忘
忙
忠
忧
快
念
忽
怀
态
怅
怎
思
怡
急
性
怨
怪
总
恆
恋
恐
恒
恕
恨
恩
恭
息
恵
恶
恼
悉
悔
悖
悚
悟
悠
患
您
悪
悲
悸
情
惆
惊
惜
惠
想
惹
意
愚
愛
感
愤
愿
慈
態
慢
慧
憲
懂
懲
懺
懼
戀
戏
成
我
戒
或
战
戦
戰
戲
戶
户
戸
房
所
手
才
打
托
执
批
找
承
技
抄
把
投
抖
抗
折
抜
护
报
披
抱
抹
抽
拉
拍
拒
拔
拘
招
拜
拝
拥
括
拳
拼
拿
持
指
按
挑
挖
捕
换
捧
掃
授
掉
掌
排
掘
探
接
推
掰
提
揚
換
握
揣
搜
搞
携
摇
摩
撃
撈
撑
撒
撞
播
撻
擊
操
擔
擦
支
收
改
攻
放
政
故
效
敏
救
敗
教
敢
散
敦
敬
数
整
敷
數
文
斑
斗
料
斜
斯
新
方
於
施
旅
旋
族
旗
无
既
日
旦
旧
旨
早
时
昂
昆
昇
昌
明
易
星
映
春
昧
昭
是
显
時
晉
晋
晓
晨
晩
普
晶
智
暗
暴
曜
曲
更
書
曹
曼
曾
替
最
會
月
有
朋
服
朔
朗
望
朝
期
木
未
末
本
术
朱
机
朽
杀
杂
权
李
杏
材
村
杖
杜
束
杠
条
来
杨
杭
杯
東
松
板
极
构
析
林
枚
果
枝
某
柔
查
柴
标
树
栗
校
株
样
核
根
格
桃
案
桑
桓
桔
桥
梁
梅
梗
條
梦
梯
械
梵
检
棒
森
椅
植
椒
楠
業
極
楼
楽
榮
榻
槍
樂
樓
標
樣
樹
橄
機
檢
櫻
欄
權
欖
次
欢
欧
欲
款
歇
歉
歌
歐
歡
正
此
步
武
歩
歪
歳
歴
死
殘
段
殺
殿
毀
毅
母
毎
每
毒
比
毛
毫
氏
民
气
気
氛
氣
水
永
汁
求
汇
汉
汐
汕
汗
汝
江
池
污
汤
汪
汶
汹
決
汽
沈
沉
沌
沒
沙
沟
没
河
油
治
泉
法
泛
泡
波
泥
注
泪
泰
泳
泽
洋
洗
洞
津
洲
活
派
流
测
济
浓
浙
浦
浩
浪
浴
海
涂
消
润
液
涵
涼
淇
淋
淘
淡
淮
深
混
清
渉
渠
渡
渣
温
港
渴
游
湖
湘
湯
湾
源
準
溪
溫
滅
滋
滑
满
滨
滿
漏
演
漠
漢
漫
漲
漿
潘
潜
潮
澎
澤
澳
激
濁
濃
濟
濫
瀛
瀬
灣
火
灯
灰
灵
災
灿
炉
炎
炒
炭
炮
炸
点
為
烂
烈
烏
烙
烟
烤
烦
烧
热
無
焦
然
焼
煎
煤
照
煮
煽
熊
熟
熱
燃
燒
燕
營
爆
爛
爪
爬
爭
爱
爵
父
爷
爸
爹
爺
爽
片
版
牌
牙
牛
牟
牡
牢
牧
物
特
犬
犯
状
犹
狂
狄
狗
狩
独
狼
猛
猪
猫
献
獄
獎
獣
獨
獲
獸
玄
王
玛
玩
玫
环
现
玲
珍
珠
班
現
球
理
琦
琪
琴
瑋
瑞
瑰
瑶
璇
環
瓜
瓦
甘
甚
甜
生
產
産
用
田
由
甲
电
男
画
畅
界
畏
留
畜
番
當
疆
疏
疑
疫
疼
疾
病
痛
痴
瘋
発
登
發
白
百
的
皆
皇
皮
盆
益
盐
监
盗
盘
盛
目
直
相
盼
省
眉
看
県
真
眷
眼
眾
着
睛
督
瞎
瞥
知
石
码
砂
研
破
硝
硬
确
碗
碼
礦
示
礼
社
祖
祝
神
祥
票
祭
禁
禅
福
禧
禪
禮
离
禾
秀
私
秋
种
科
秒
秘
租
秦
称
移
程
種
稳
稻
稽
穂
究
穷
空
窑
窗
立
站
章
端
竹
笑
笔
笛
笠
符
第
筆
等
筋
筑
筒
答
策
筷
筹
签
简
算
管
箭
箱
箸
節
篇
簡
簿
籍
米
类
粉
粒
粥
粪
粱
粵
粹
粽
精
粿
糊
糕
糖
糞
糠
糸
系
約
紅
納
級
素
索
紫
細
紹
結
絕
絡
給
統
絲
絶
經
続
綠
維
線
編
縱
總
繰
红
约
级
纪
纳
纽
练
组
细
终
绍
经
结
给
络
绝
统
继
续
绰
维
绿
缓
缘
缺
网
罗
罢
罪
署
羅
羊
美
群
義
習
翔
翘
翻
耀
老
考
者
而
耕
耗
耳
职
联
聖
聘
聞
聯
聲
聽
肉
肌
肚
肠
股
肥
肪
肯
育
胃
胆
背
胎
胖
胜
胞
胡
胳
胶
能
脂
脆
脈
脉
脐
脑
脚
脩
脱
脳
脸
脹
腐
腔
腕
腦
腩
腫
腰
腳
腸
腾
腿
膊
臣
自
臭
至
致
臺
與
興
舊
舌
舍
舎
舒
舜
舞
舟
航
舰
船
艙
艦
良
色
艳
艺
艾
节
芋
芙
芝
芥
芬
芭
花
芳
芹
芽
苏
苔
苗
若
苦
英
苹
茂
范
茄
茶
草
荒
荣
药
荷
莎
莫
获
菇
菜
菩
華
菱
菲
萄
萊
萍
萝
营
萨
落
葉
著
葡
葬
葱
葵
蒙
蒟
蒸
蓋
蓮
蔗
蔡
蕉
蕾
薄
薩
藏
蘇
蘋
蘭
蘿
虎
處
虚
虞
號
虫
虹
蚁
蚂
蚊
蛇
蛋
蜂
蜆
蜍
蜜
蜢
蜻
蜿
蝉
蝦
蝶
融
蠢
蠻
血
衆
行
術
街
衛
衡
衣
补
表
衫
袋
袍
被
裁
裏
裔
補
裡
製
複
襄
西
要
覆
見
視
覧
観
覺
觀
见
观
规
视
觉
角
解
言
訂
計
訊
記
許
訴
詛
詞
詢
詩
話
該
詳
認
誒
誕
語
說
誰
誹
調
談
請
諏
論
諮
諷
諸
諾
謗
講
謝
證
識
譜
警
議
護
譽
變
讚
计
认
让
训
记
讲
许
论
讼
讽
设
证
评
诅
识
诉
词
译
诗
诚
话
诞
该
语
误
说
请
诸
诺
读
课
谁
调
谅
谈
谋
谐
谢
谣
谱
谷
豆
豉
豚
象
豪
豬
豹
貌
貓
財
貴
買
費
貿
資
賊
賞
質
賴
賽
贈
贊
贓
负
财
贤
败
质
贩
贫
贵
贸
费
贼
资
赐
赢
赤
赫
走
赵
起
超
越
趕
趣
足
跑
跟
跡
路
践
踏
蹤
蹲
躊
身
車
軌
軍
軟
転
軸
較
輪
轉
车
轨
转
轮
轻
载
较
辛
辞
辣
辦
辱
農
边
达
迁
迂
过
迈
迎
运
近
返
还
这
进
远
连
迦
迪
迫
述
迴
迷
迹
追
退
送
逃
逆
透
逐
递
途
這
通
逞
造
連
逮
週
進
逸
遇
遊
運
遍
過
道
達
違
遥
適
邂
邓
那
邦
邪
邱
郊
郎
郑
郝
部
郵
都
鄭
配
酒
酢
酥
酱
酷
酸
酿
醉
醋
醒
醬
里
重
野
量
金
釣
鈴
鉄
鉛
銀
鋪
錶
鍾
鎖
鎮
鎳
鑽
钱
铁
银
锅
错
镇
镜
長
长
門
閃
閉
開
間
関
閣
閱
關
门
问
间
闹
闻
阁
阎
阜
队
阪
防
阳
阴
阵
阶
阿
陀
附
际
陆
陈
降
限
院
陣
陪
陵
陶
陷
陸
陽
隆
隊
隋
階
随
隔
隕
際
障
隣
隧
隨
难
雀
雄
雅
集
雕
雙
雞
難
雨
雲
零
雷
電
需
震
霧
露
霸
靈
青
静
靚
靜
非
面
革
鞋
韓
韩
音
韵
頁
頂
項
順
預
領
頭
頻
題
額
顛
類
顶
项
顺
顾
顿
题
颤
風
风
飘
飞
食
飯
飲
飾
餃
餅
養
餐
餓
館
饭
饶
饺
馆
首
香
馬
駐
駕
駛
驗
马
驱
驶
驾
骨
體
高
鬆
鬥
鬼
魄
魔
魚
鮮
鯊
鱼
鲁
鲜
鳥
鳳
鴨
鵝
鵡
鵧
鸟
鸡
鸣
鸥
鸭
鸳
鸽
鸿
鹰
鹵
鹹
鹿
麗
麥
麦
麵
麻
麼
黄
黎
黑
默
點
黨
鼓
鼠
鼻
齁
齐
龄
龍
龙
가
각
간
갈
감
갑
값
갔
강
같
개
거
건
걸
겁
것
게
겨
격
경
계
고
골
공
과
관
광
교
구
국
군
그
근
글
금
기
길
김
깁
까
깐
깔
께
꽃
끔
끝
나
낙
난
날
납
났
내
냅
너
네
넷
녁
년
녕
노
누
눌
느
는
늘
늦
니
님
다
단
달
닭
답
당
대
더
데
도
독
동
되
두
둑
둘
드
들
듭
등
디
따
때
땡
떤
떻
또
똑
라
락
란
람
랍
래
러
런
럼
려
렵
령
로
론
르
른
를
름
릅
릉
리
릴
마
막
만
많
말
맞
매
맥
맹
머
먹
면
명
모
목
못
무
문
물
뭐
뭘
미
민
밌
바
박
받
발
밤
밥
방
배
번
법
벽
병
보
복
볶
본
볼
봅
봐
봤
부
분
불
비
빈
빔
빠
빨
빵
뻐
뿅
쁩
사
산
살
샀
상
색
생
서
선
성
세
셋
소
속
손
송
수
숙
쉽
스
슨
습
시
식
신
실
심
십
싶
싸
쌉
쓰
씨
아
악
안
않
알
암
았
앞
야
약
양
어
억
언
엄
업
없
었
에
여
역
연
열
영
예
옛
오
옵
와
왔
외
요
용
우
욱
운
워
원
월
웠
위
유
육
윤
으
은
을
음
응
의
이
인
일
읽
있
자
작
잘
잠
잡
장
재
저
적
전
점
접
정
제
젯
조
족
졸
종
좋
주
죽
줄
중
줬
즐
즘
지
직
진
질
집
징
쩌
찍
차
참
창
책
처
천
철
청
초
촌
추
춘
출
춥
충
취
층
치
친
침
칩
커
컬
켜
크
큽
타
탁
탄
택
터
토
통
투
팀
파
판
편
표
프
피
필
하
학
한
할
함
합
해
했
행
향
헌
혀
현
형
호
혼
홈
화
환
활
회
후
희
히
힘
ﷺ
ﷻ
�
